In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get th

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
#-- 1.How many distinct (different) actors' last names are there?



data = pd.read_sql_query('SELECT COUNT(DISTINCT (last_name)) FROM sakila.actor', engine)
data.head()

   COUNT(DISTINCT (last_name))
0                          121

In [5]:
data = pd.read_sql_query('''SELECT title
FROM film
WHERE title like "%%ARMAGEDDON%%"''', engine)
data.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

In [6]:
data = pd.read_sql_query("""SELECT title, length 
FROM film 
Order by length desc
limit 10 """,engine)
data.head()

            title  length
0  DARN FORRESTER     185
1    POND SEATTLE     185
2   CHICAGO NORTH     185
3   MUSCLE BRIGHT     185
4    WORST BANGER     185

In [7]:
data = pd.read_sql_query("""SELECT count(special_features) as "behind the scenes"
FROM film
WHERE special_features like '%%Behind the Scenes%%'""",engine)
data.head()

   behind the scenes
0                538

In [8]:
data = pd.read_sql_query("""SELECT rating, avg(length)
FROM film
GROUP by rating
HAVING avg(length)> 120
""",engine)
data.head()

  rating  avg(length)
0  PG-13     120.4439

In [9]:
data = pd.read_sql_query("""SELECT title, length, RANK() OVER(ORDER BY length DESC) as 'Rank'
FROM film""",engine)
data.head()

            title  length  Rank
0   CHICAGO NORTH     185     1
1  CONTROL ANTHEM     185     1
2  DARN FORRESTER     185     1
3     GANGS PRIDE     185     1
4       HOME PITY     185     1